Обработки/DataProcessors/_ВыгрузкаДанныхВЛичныйКабинетКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаДанныхВЛичныйКабинетКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередатьВсехКлиентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Обработки/DataProcessors/_ВыгрузкаДанныхВЛичныйКабинетКлиента/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтаФорма.Элементы.Клиенты.Видимость = НЕ ЭтаФорма.Объект.ПередатьВсехКлиентов;
	
КонецПроцедуры	

////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.Период               = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	Объект.Организация          = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Объект.ПередатьВсехКлиентов = Истина;
	Объект.Сервер               = "ap25.G1.LAN";
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтбиратьКлиентовПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПередатьДанныеВЛичныйКабинетКлиента(Команда)
	
	ПередатьДанныеВЛичныйКабинетКлиентаНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередатьДанныеВЛичныйКабинетКлиентаНаСервере()
	
	РеквизитФормыВЗначение("Объект").ПередатьДанныеВЛичныйКабинетКлиента(Истина);

КонецПроцедуры
